app/views/receivers/new.html.erb

SELECT `messages`.* FROM `messages`
---
      <ul>
      <% @receiver.errors.full_messages.each do |msg| %>

SELECT `messages`.* FROM `messages` INNER JOIN `messages_receivers` ON `messages`.`id` = `messages_receivers`.`message_id` WHERE `messages_receivers`.`receiver_id` IS NULL
---
   <table class="table-striped table-condensed">
    <tr><td> <%=select('message1', "id", Message.all.collect {|m| [ m.message_text, m.id ] }, {:include_blank => false, :selected => "1"}, :class=>"span6") %></td></tr>