app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 8 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO `orders` (`comments`, `created_at`, `delivery_location`, `delivery_sub_location`, `delivery_time`, `menu_id`, `status`, `updated_at`, `user_id`) VALUES ('', '2011-11-20 02:49:57', 'umich - Ann Arbor', 'dunderstat library', '2011-11-20 02:49:00', 1, 'open', '2011-11-20 02:49:57', 1)
---
  def create
    p params
    @confirmation_code = rand(1200)
    @order = Order.new(params[:order])
    @order.menu_id = params[:menu_id]
    @order.user_id = params[:user_id]
    @order.confirmation_code = @confirmation_code

    respond_to do |format|
      if @order.save