app/controllers/receivers_controller.rb

  def index
    @receivers = Receiver.all
---
SELECT `receivers`.* FROM `receivers`

  def show
    @receiver = Receiver.find(params[:id])
---
SELECT `receivers`.* FROM `receivers` WHERE `receivers`.`id` = 2 LIMIT 1

  def edit
    @receiver = Receiver.find(params[:id])
---
SELECT `receivers`.* FROM `receivers` WHERE `receivers`.`id` = 48 LIMIT 1

  def create

    @receiver = Receiver.new(params[:receiver])

    respond_to do |format|
      if @receiver.save
     #   format.html { redirect_to @receiver, notice: 'Receiver was successfully created.' }
        format.html { redirect_to root_path, notice: 'Receiver created. Please check your email to complete registration. Text messages will start soon. thanks' }
        format.json { render json: @receiver, status: :created, location: @receiver }

    @receiver.reload
    @rid = Receiver.last.id
---
INSERT INTO `receivers` (`accepted_tos`, `created_at`, `name`, `phone`, `t1`, `t2`, `t3`, `t4`, `t5`, `t6`, `timezone`, `updated_at`, `user_id`) VALUES (NULL, '2012-02-08 23:53:45', 'dad', 78765, NULL, NULL, NULL, NULL, NULL, NULL, 'mountain', '2012-02-08 23:53:45', NULL)
SELECT `receivers`.* FROM `receivers` ORDER BY `receivers`.`id` DESC LIMIT 1